//
//  CityView.swift
//  OYTG
//
//  Created by 김남정 on 2017. 5. 18..
//  Copyright © 2017년 NamJung. All rights reserved.
//

import Foundation

class CityView {
    var cityOption = ["전체","서울","인천","대전","대구","광주","부산","울산","세종","경기도","강원도","충청북도","충청남도","경상북도","경상남도","전라북도","전라남도","제주도"]
    var cityCode = [0,1,2,3,4,5,6,7,8,31,32,33,34,35,36,37,38,39]

    var detail = [
        0:["전체"],
        1:["전체","강남구","강동구","강북구","강서구","관악구","광진구","구로구","금천구","노원구","도봉구","동대문구","동작구","마포구","서대문구","서초구","성동구","성북구","송파구","양천구","영등포구"],
        2:["전체","강화군","계양구","남구","남동구","동구","부평구","서구","연수구","옹진군","중구"]]
    func test(){
        if let test = detail[0]?[0]{
            print(test)
        }
    }
    
}
