//
//  ThemaData.swift
//  OYTG
//
//  Created by 김남정 on 2017. 5. 19..
//  Copyright © 2017년 NamJung. All rights reserved.
//

import Foundation

class ThemaData{
    let largeThema = ["대분류 전체","자연","문화/예술/역사","추천코스","레포츠","숙박","쇼핑","음식"]
    let largeCode = ["","A01","A02","C01","A03","B02","A04","A05"]
    let midThema = [
                ["중분류 전체"],
                ["중분류 전체","자연관광지","관광자원"],
                ["중분류 전체","역사관광지","휴양관광지","체험관광지","산업관광지","건축/조형물","문화시설","축제","공연/행사"],
                ["중분류 전체","가족코스","나홀로코스","힐링코스","도보코스","캠핑코스","맛코스"],
                ["중분류 전체","레포츠소개","육상 레포츠","수상 레포츠","항공 레포츠","복합 레포츠"],
                ["중분류 전체","숙박시설"],
                ["중분류 전체","쇼핑"],
                ["중분류 전체","음식점"]]
    let midCode = [
        [""],
        ["","A0101","A0102"],
        ["","A0201","A0202","A0203","A0204","A0205","A0206","A0207","A0208"],
        ["","C0112","C0113","C0114","C0115","C0116","C0117"],
        ["","A0301","A0302","A0303","A0304","A0305"],
        ["","B0201"],
        ["","A0401"],
        ["","A0502"]]
    let smallThema = [
        [["소분류 전체"]],
        [["소분류 전체"],["자연관광지 전체","국립공원","도립공원","군립공원","산","자연생태관광지","자연휴양림","수목원","폭포","계곡","약수터","해안절경","해수욕장","섬","항구/포구","어촌","등대","호수","강","동굴"],["관광자원 전체","희귀동식물","기암괴석"]],
        [["소분류 전체"],["역사관광지 전체","고궁","성","문","고택","생가","민속마을","유적지/사적지","사찰","종교성지","안보관광"],["휴양관광지 전체","유원지","관광단지","온천/욕장/스파","이색찜질방","헬스투어","테마공원","공원","유람선/잠수함관광"],["체험관광지 전체","농.산.어촌 체험","전통체험","산사체험","이색체험","관광농원","이색거리"],["산업관광지 전체","제철소","조선소","공단","발전소","광산","식음료","화학/금속","기타","전자/반도체","자동차"],["건축/조형물 전체","다리/대교","기념탑/기념비/전망대","분수","동상","터널","유명건물"],["문화시설 전체","박물관","기념관","전시관","컨벤션센터","미술관/화랑","공연장","문화원","외국문화원","도서관","대형서점","문화전수시설","영화관","어학당","학교"],["축제 전체","문화관광축제","일반축제"],["공연/행사 전체","전통공연","연극","뮤지컬","오페라","전시회","박람회","컨벤션","무용","클래식음악회","대중콘서트","영화","스포츠경기","기타행사"]],
        [["소분류 전체"],["가족코스 전체","가족코스"],["나홀로코스 전체","나홀로코스"],["힐링코스 전체","힐링코스"],["도보코스 전체","도보코스"],["캠핑코스 전체","캠핑코스"],["맛코스 전체","맛코스"]],
        [["소분류 전체"],["레포츠소개 전체","육상레포츠","수상레포츠","항공레포츠"],["육상 레포츠 전체","스포츠센터","수련시설","경기장","인라인","자전거하이킹","카트","골프","경마","경륜","카지노","승마","스키/스노보드","스케이트","썰매장","수렵장","사격장","야영장,오토캠핑장","암벽등반","빙벽등반","서바이벌게임","ATV","MTB","오프로드","번지점프","자동차경주","스키(보드) 렌탈샵","트래킹"],["수상 레포츠 전체","윈드서핑/제트스키","카약/카누","요트","스노쿨링/스킨스쿠버다이빙","민물낚시","바다낚시","수영","래프팅"],["항공 레포츠 전체","스카이다이빙","초경량비행","헹글라이딩/패러글라이딩","열기구"],["복합 레포츠 전체","복합 레포츠"]],
        [["소분류 전체"],["숙박시설 전체","관광호텔","수상관광호텔","전통호텔","가족호텔","콘도미니엄","유스호스텔","펜션","여관","모텔","민박","게스트하우스","홈스테이","서비스드레지던스","의료관광호텔","소형호텔","한옥스테이"]],
        [["소분류 전체"],["쇼핑 전체","5일장","상설시장","백화점","면세점","할인매장","전문상가","공예,공방","관광기념품점","특산물판매점"]],
        [["소분류 전체"],["음식점 전체","한식","서양식","일식","중식","아시아식","패밀리레스토랑","이색음식점","채식전문점","바/까페","클럽"]]]
    let smallCode = [
        [[""]],
        [[""],["","A01010100","A01010200","A01010300","A01010400","A01010500","A01010600","A01010700","A01010800","A01010900","A01011000","A01011100","A01011200","A01011300","A01011400","A01011500","A01011600","A01011700","A01011800","A01011900"],
                ["","A01020100","A01020200"]],
        [[""],["","A02010100","A02010200","A02010300","A02010400","A02010500","A02010600","A02010700","A02010800","A02010900","A02011000"],
                ["","A02020100","A02020200","A02020300","A02020400","A02020500","A02020600","A02020700","A02020800"],
                ["","A02030100","A02030200","A02030300","A02030400","A02030500","A02030600"],
                ["","A02040100","A02040200","A02040300","A02040400","A02040500","A02040600","A02040700","A02040800","A02040900","A02041000"],
                ["","A02050100","A02050200","A02050300","A02050400","A02050500","A02050600"],
                ["","A02060100","A02060200","A02060300","A02060400","A02060500","A02060600","A02060700","A02060800","A02060900","A02061000","A02061100","A02061200","A02061300","A02061400"],
                ["","A02070100","A02070200"],
                ["","A02080100","A02080200","A02080300","A02080400","A02080500","A02080600","A02080700","A02080800","A02080900","A02081000","A02081100","A02081200","A02081300"]],
        [[""],
                ["","C01120001"],
                ["","C01130001"],
                ["","C01140001"],
                ["","C01150001"],
                ["","C01160001"],
                ["","C01170001"]],
        [[""],
                ["","A03010100","A03010200","A03010300"],
                ["","A03020100","A03020200","A03020300","A03020400","A03020500","A03020600","A03020700","A03020800","A03020900","A03021000","A03021100","A03021200","A03021300","A03021400","A03021500","A03021600","A03021700","A03021800","A03021900","A03022000","A03022100","A03022200","A03022300","A03022400","A03022500","A03022600","A03022700"],
                ["","A03030100","A03030200","A03030300","A03030400","A03030500","A03030600","A03030700","A03030800"],
                ["","A03040100","A03040200","A03040300","A03040400"],
                ["","A03050100"]],
        [[""],
                ["","B02010100","B02010200","B02010300","B02010400","B02010500","B02010600","B02010700","B02010800","B02010900","B02011000","B02011100","B02011200","B02011300","B02011400","B02011500","B02011600"]],
        [[""],
                ["","A04010100","A04010200","A04010300","A04010400","A04010500","A04010600","A04010700","A04010800","A04010900"]],
        [[""],
                ["","A05020100","A05020200","A05020300","A05020400","A05020500","A05020600","A05020700","A05020800","A05020900","A05021000"]]]
    

}
